lastNames = ['Александровская', 'Гапонов', 'Забровский', 'Жихарев', 'Ивашов', 'Изотов', 'Королева', 'Михальченко', 'Морошкин', 'Политыкина', 'Росляков', 'Свиряев', 'Стрельбин', 'Федоров', 'Цыганков', 'Чепиков', 'Ширяева', 'Щербакова', 'Ястребова']
firstNames = ['Алина', 'Данила', 'Валерий', 'Дмитрий', 'Роман', 'Виктор', 'Елена', 'Макар', 'Василий', 'Наталья', 'Андрей', 'Дмитрий', 'Илья', 'Игорь', 'Егор', 'Иван', 'Ангелина', 'Ника', 'Марина']
snus = []

for (j = 0; j < lastNames.length; j++) {
    for (i = 0; i < abits.length; i++) {
        if ((abits[i].lastName == lastNames[j]) && (abits[i].firstName == firstNames[j]) && (abits[i].agreement) == 'True') {
            snus[j] = abits[i].snils.replace(' ', '-')
            console.log(abits[i].lastName, ': ', abits[i])
        }
    }
}